Repository: 84000/data-translation-memory
Catalog: toh114-v1.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ས་ཕྱོགས་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པའི་ས་ཕྱོགས་དེ་ནི་དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་པ་ལགས་སོ། །
en: Blessed One, wherever this Dharma teaching spreads, that place will be blessed by the Thus-Gone One

source: ས་ཕྱོགས་དེ་ནི་མཆོད་རྟེན་དུ་གྱུར་པར་བལྟ་བར་བགྱིའོ། །
en: and should be regarded as a place of worship.

source: ས་ཕྱོགས་དེ་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱག་བགྱི་བའི་གནས་ལགས་སོ། །
en: Such a place should be revered by the world with its gods, humans, and asuras.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ། །
en: “Thus it is, thus it is, noble son!” replied the Blessed One.

source: དེ་དེ་བཞིན་ཏེ། རིགས་ཀྱི་བུ་ས་ཕྱོགས་དེ་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱག་བྱ་བའི་གནས་ཡིན་ནོ། །
en: “Noble son, that place is indeed to be revered by the world with its gods, humans, and asuras.”

source: བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཡང་མཆོད་པ་བགྱིད་ལ་འདིའི་སླད་དུ་མཆོད་པ་དང་བཀུར་སྟི་ལ་བརྩོན་པའི་སེམས་ཀྱིས་སྦྱིན་པ་ཡུངས་འབྲུ་ཙམ་སྩལ་ན།
en: “if someone worships this Dharma teaching and makes an offering to it of a single mustard seed, with a mind inspired by veneration and respect,

source: དེའི་མཚམས་མེད་པ་ལྔའི་ལས་རྣམས་ཡོངས་སུ་ཟད་པར་འགྱུར་ལ།
en: all the karma they have generated by engaging in the five acts with immediate retribution will be completely exhausted.

source: བསྐལ་པ་དགུ་ཁྲིའི་བར་དུ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །བསྐལ་པ་བརྒྱད་ཁྲིའི་བར་དུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་རོ། །
en: They will be reborn in wealthy families for ninety thousand eons and as a universal monarch for eighty thousand eons.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །གཤིས་ངན་དུ་འགུམ་པར་མི་འགྱུར་རོ། །ངན་སོང་དུ་སྐྱེ་བར་མི་འགྱུར།
en: They will be reborn in the pure buddha realms, will not die a horrible death, and will not be reborn in the lower realms.

source: བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: All their aspirations will be completely fulfilled.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One then said to the bodhisattva great being noble Avaloki­teśvara,

source: རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་བགྲང་བ་ལས་འདས་པ་ན།
en: “Noble son, in the past, countless eons ago,

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ཡེ་ཤེས་མཐའ་ཡས་པ་ཆགས་པ་མེད་ཅིང་རྡུལ་དང་བྲལ་བའི་རྒྱལ་པོའི་ཏོག་ཅེས་བྱ་བ་བྱུང་སྟེ།
en: appeared the thus-gone one called Dharma­jñānāsaṅga­viraja­ketu­rāja.

source: དེར་ངས་བྲམ་ཟེའི་གཟུགས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་སོ། །ཐོས་ནས་ཀྱང་སེམས་ཅན་རྣམས་ལ་བཤད་དོ། །
en: At that time I had taken birth as a brahmin and heard this Dharma teaching, which I then taught to others.

source: དེར་ངས་རྙེད་པའི་མོད་ལ་ཆོས་ལ་བཟོད་པ་ཐོབ་སྟེ། ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་གོ། །
en: As soon as I received this teaching, I became receptive to the unborn nature of phenomena and purified my spiritual insight into phenomena.

source: སེམས་ཅན་གང་དག་གིས་ཐོས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ངན་སོང་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་ཏེ།
en: All those who heard this teaching were freed from the lower realms

source: ནམ་ཡང་ངན་སོང་དུ་མི་འགྲོ་བར་འགྱུར་ལ།
en: and would never again fall back into such states of existence.

source: ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་སྟེ།
en: Their spiritual insight into phenomena was purified.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་མཐར་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: All those beings will eventually awaken to unsurpassed and perfect buddhahood.

source: རིགས་ཀྱི་བུ་ངས་ཀྱང་ལོ་མང་པོ། །ལོ་བརྒྱ་ཕྲག་མང་པོ། །ལོ་སྟོང་ཕྲག་མང་པོ། །ལོ་འབུམ་ཕྲག་མང་པོར་
en: “Noble son, for many years, for many hundreds, thousands, and hundreds of thousands of years,

source: སེམས་ཅན་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་དཀྲིས་པ་རྣམས་ཀྱི་ཕྱིར་ནོར་དང་། འབྲུ་དང་། འགྲོན་བུ་དང་། གསེར་ཡོངས་སུ་གཏོང་བ་བྱས་ནས། །
en: I gave away my wealth, grains, cowries, and gold to help those who were bound by attachment, anger, and ignorance.

source: མཐར་གྱིས་ལག་པ་དང་། རྐང་པ་དང་། མིག་དང་། མགོ་བོ་དང་། སྡུག་པའི་བུ་དང་། ཆུང་མ་དང་། བུ་མོའི་བར་དུ་ཡོངས་སུ་གཏོང་བར་བྱས་སོ། །
en: Eventually, I gave away my arms, legs, eyes, and head, as well as my beloved sons, spouses, and daughters.

source: རྐང་དང་། རུས་པ་ཡོངས་སུ་གཏོང་བ་དང་། ཁྱིམ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་ཡོངས་སུ་གཏོང་བ་བྱས་སོ། །
en: I gave away my marrow and my bones, my homes, my villages, my towns, my cities, my countries, and my royal palaces.

source: ལོ་འབུམ་ཕྲག་དུ་མར་ཚངས་པར་སྤྱོད་པ་ཡང་སྤྱད་དོ། །ཁྱིམ་པ་དང་འདྲིས་པར་མ་བྱས། རྒྱལ་སྲིད་ལ་དགའ་བ་དང་།
en: For hundreds of thousands of years I observed celibacy, stayed away from households, and never enjoyed kingdoms,

source: ནོར་ལ་དགའ་བ་དང་། ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་ལ་དགའ་བ་དང་། བུ་དང་བུ་མོ་ལ་དགའ་བ་དང་། ཆུང་མ་ལ་དགའ་བར་མ་བྱས་སོ། །
en: wealth, countries, palaces, retinues, sons, daughters, or spouses.

source: གཅིག་ཏུ་ངེས་པར་ཚངས་པར་སྤྱོད་པ་ལ་གནས་པ་བརྟེན་ཏོ། །གཅིག་ཏུ་ངེས་པར་སྦྱིན་པ་བྱིན་ནོ། །
en: I was entirely celibate, and only performed acts of generosity.

source: གཅིག་ཏུ་ངེས་པར་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་རྣམས་ལ་མཆོད་པ་དང་། བསྙེན་བཀུར་བྱས་སོ། །
en: I focused only on worshiping and serving the Buddha, the Dharma, and the Saṅgha.

source: གཅིག་ཏུ་ངེས་པར་ངས་ཆོས་སྨྲ་བ་རྣམས་ལ་
en: I continuously honored, respected, worshiped, and venerated those who taught the Dharma,

source: མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་བཀུར་སྟིར་བྱས། བླ་མར་བྱས། རི་མོར་བྱས། མཆོད་པར་བྱས་སོ། །
en: offering them flowers, incense, perfumes, flower garlands, ointments, powders, clothes, parasols, victory banners, and flags.

source: བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་
en: ointments, powders, clothes, parasols, victory banners, and flags.

source: དགེ་བའི་བཤེས་གཉེན་མང་པོ་ཡང་། ངས་བསྙེན་བཀུར་བྱས་སོ། །དེ་ཡང་ངས་འཁོར་བ་ལ་སྐྱོ་བའི་ལུགས་ཀྱིས་
en: I served many spiritual friends, and with weariness toward saṃsāra,

source: ལུས་རྣམས་བྱིན་ལ། མིག་རྣམས་དང་། རང་གི་ཤ་རྣམས་དང་། རྐང་དང་། རུས་པ་རྣམས་དང་། རང་གི་པགས་པ་རྣམས་ཀྱང་བྱིན་ན། ཕྱི་རོལ་གྱི་དངོས་པོ་གཞན་དག་ལྟ་ཅི་སྨོས་ཏེ།
en: offered my own body, eyes, flesh, marrow, bones, and skin—not to mention all the outer material things

source: ང་འགྱོད་པར་གྱུར་པ་ཡང་མེད་དོ།
en: —without ever feeling any regret.”

source: དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་ཚུལ་འདི་ཐོས་ནས། །
en: When they heard about the past deeds of the Thus-Gone One,

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷའི་དབང་པོ་རྣམས་དང་། ཀླུའི་དབང་པོ་རྣམས་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་རྣམས་དང་།
en: the bodhisattvas, the lords of the gods, the lords of the nāgas, the lords of the yakṣas,

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་རྣམས་དང་། མིའི་དབང་པོ་རྣམས་དང་། སྤྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་དང་། གཅེར་བུ་པ་རྣམས་ཀྱིས་
en: the lords of the asuras, the lords of humans, the carakas, the parivrājakas, and the nirgranthas all shed tears,

source: ཆོས་ཀྱི་ཤུགས་ཀྱིས་མཆི་མ་བླགས་ཏེ། དེ་དག་ཐམས་ཅད་ཀྱིས་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: moved by the power of the Dharma, and became receptive to the unborn nature of phenomena.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །
en: “My friends,” continued the Blessed One, “uphold this Dharma teaching!

source: འདི་ནི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་བྱ་བ་བྱེད་པ་ཡིན་ནོ། །
en: It performs the activity of the Thus-Gone One for the sake of beings.”

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་དད་པ་དང་། མཆོད་པ་བགྱིད་པ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པའི་སེམས་ཅན་དེ་དག་ནི་དཀོན་ལགས་སོ། །
en: “Blessed One, rare are the beings who have faith in this Dharma teaching, worship it, memorize it, read it aloud, and master it.

source: གང་དག་གི་སུག་པར་མཆིས་པ་དེ་དག་ནི་སངས་རྒྱས་བྱུང་བ་དང་འདྲ་བར་བལྟ་བར་བགྱིའོ། །
en: Anyone who upholds this teaching should be regarded as a buddha appearing in the world.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ།
en: “Excellent, excellent, noble son!” replied the Blessed One. “Thus it is, noble son!

source: རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པ་བྱེད་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་འཇུག་པ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཆོས་སྨྲ་བ་དེ་དག་ལ་ཡང་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་མཆོད་པ་བྱེད་པ་དེ་དག་ནི་དཀོན་ཏེ།
en: Rare are the noble sons or daughters who worship this Dharma teaching, write it down, commission it to be written, memorize it, read it, and worship those who teach it with flowers, incense, perfumes, flower garlands, ointments, powders, clothes, parasols, victory banners, and flags.

source: དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བ་ཁོ་ནར་བལྟ་བར་བྱའོ། །
en: They themselves should be regarded as thus-gone ones.

source: རིགས་ཀྱི་བུ་སེམས་ཅན་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པ་མི་བྱེད་པ་དང་། འཛིན་པར་མི་བྱེད་པ་དང་།
en: “Noble son, there will be beings who do not worship this Dharma teaching, who do not memorize it,

source: ཀློག་པར་མི་བྱེད་པ་དང་། སྦྱིན་པ་མི་བྱེད་པ་དག་འབྱུང་བར་འགྱུར་ཏེ།
en: read it aloud, or make offerings to it.

source: དེ་དག་ནི་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་དང་། བསྐལ་པ་སྟོང་གི་བར་དུ་འཁོར་བ་ན་འཁོར་བར་འགྱུར་ཏེ།
en: They will circle in saṃsāra for many eons, for a hundred or a thousand eons.

source: སྡུག་བསྔལ་བ་མང་པོ་སྡུག་བསྔལ་བརྒྱ་དག་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ། །
en: They will experience much suffering, hundreds of types of suffering.

source: འདི་ལྟ་སྟེ་དཔེར་ན་བུད་མེད་སྦྲུམ་མ་ཞིག་ཡོད་ལ།
en: As an analogy, consider a pregnant woman.

source: བུད་མེད་སྦྲུམ་མ་དེའི་ལྟོ་ན་བུ་ཆགས་པ་དེ་ཡང་ཁྱེའུ་འམ། བུ་མོ་ཞིག་ཏུ་གྱུར་ན། བུད་མེད་དེའི་བུ་དེ་གང་གི་ཚེ་
en: When her baby boy or girl is forming in her womb during the different stages of the pregnancy

source: ཟླ་བ་གཅིག་ལོན་ནམ། ཟླ་བ་གཉིས་ལོན་ནམ། ཟླ་བ་གསུམ་ལོན་ནམ། ཟླ་བ་ལྔ་ལོན་ནམ། ཟླ་བ་ཚང་བའི་བར་དུ་གྱུར་པ་དེ་
en: —from the first, second, third, fourth, and fifth month all the way until the birth of the child

source: ཙམ་དུ་བུད་མེད་དེའི་ལུས་ནོན་པར་འགྱུར་ཏེ།
en: —the mother’s body is taken over by the baby.

source: ཚིགས་ཀྱང་འབྱེ་བར་འགྱུར། ལྟོ་ཡང་ཆུང་བར་འགྱུར། སྐད་ཀྱི་གཅོམ་ཡང་ཆུང་བར་འགྱུར་ཏེ།
en: Her joints are pushed apart, she loses her appetite, and her voice becomes weak.

source: ཚོར་བ་དེ་དག་གིས་ཡོངས་སུ་གཟིར་བའི་ལུས་ཀྱིས་དེ་ཙམ་དུ་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བཞིན་དུ་ལུས་འཛིན་པར་བྱེད་དེ།
en: She carries the baby while experiencing the pain of these oppressive physical sensations.

source: བུ་བཙའ་བའི་དུས་ཀྱི་བར་དུ་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་མྱོང་ངོ་། །
en: Until the baby is born, she experiences the suffering of the hell beings,

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་གི་ཚེ་བདག་གི་བུ་བཙའ་བར་གྱུར་པ་དེའི་ཚེ། བདག་བདེ་བར་བཙས་པར་གྱུར་ན་དེའི་ཚེ་ཚངས་པར་སྤྱད་པར་བྱའོ་སྙམ་མོ། །
en: and thinks, ‘After I give birth to my child, if everything goes well, I will become celibate forever!’

source: དེ་ཕྱིས་ཡང་འདོད་པའི་འདོད་ཆགས་ཀྱིས་ཆགས་པར་གྱུར་པ་ན་སྡུག་བསྔལ་དེ་དག་ཕྱིས་མི་དྲན་ཏེ།
en: Later, however, excited by desire for sensual pleasures, she will forget all that suffering,

source: བདེ་བའི་འདུ་ཤེས་སྐྱེད་པར་བྱེད་དོ། །
en: and only think of pleasure.

source: དེ་བཞིན་དུ་ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་ན་སེམས་ཅན་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་དད་པར་མི་བྱེད།
en: “Similarly, in the future there will be beings who have no faith in this Dharma teaching,

source: མཆོད་པར་མི་བྱེད། འཛིན་པར་མི་བྱེད། ཀློག་པར་མི་བྱེད་དེ།
en: who will not worship it, memorize it, or read it aloud.

source: དེ་དག་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ།
en: They will be reborn among the hell realms, the animal realms, or in the world of the Lord of Death.

source: བདག་ཅག་གིས་ཁྱིམ་དང་། བུ་སྨད་ཡོངས་སུ་བསྐྱང་བར་བྱའོ། །ཆུང་མ་དང་། བུ་དང་། བུ་མོ་ཡོངས་སུ་བསྐྱང་བར་བྱའོ་སྙམ་མོ། །
en: ‘I have to look after my household, my family, my spouse, my sons, and my daughters.’

source: གང་གི་ཚེ་ཡང་སེམས་ཅན་དམྱལ་བར་སྐྱེས་པ་དེའི་ཚེ་ནི་འགྱོད་པར་འགྱུར་རོ།
en: When they are reborn in the hell realms, they will feel regret.

source: གང་གི་ཚེ་ཕྱིར་ཐར་བར་གྱུར་པ་དེའི་ཚེ་ནི་འདོད་ཆགས་ཀྱིས་ཆགས་ནས་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་བརྗེད་པར་འགྱུར་ཏེ། །
en: Afterward, however, once liberated from those hellish states, they will be excited by desire and forget the suffering they endured in the hell realms,

source: སྦྱིན་པ་ཡང་སྦྱིན་པར་མི་བྱེད། ཚུལ་ཁྲིམས་ཀྱང་སྲུང་བར་མི་བྱེད་དོ། །
en: and will neither engage in generosity nor maintain their discipline.

source: འདི་ལྟ་སྟེ་དཔེར་ན་མི་ཆང་གིས་ར་རོ་ཞིང་མྱོས་ཏེ།
en: “Consider also the analogy of someone intoxicated by liquor.

source: ཚབས་ཆེར་ར་རོ་ཞིང་མྱོས་ལ་གཏུ་ལུམ་པར་གྱུར་ན།
en: When someone is strongly intoxicated, to the point of being completely drunk,

source: མི་དེས་སེམས་ཀྱིས་ཀྱང་ཁྱིམ་ཚོལ་མི་ནུས་ལམ་ཡང་མི་ཚོལ།
en: they are unable to find their way home, or to their bed.

source: ཕ་མ་དང་། ཆུང་མ་དང་། བུ་དང་། བུ་མོའི་འདུ་ཤེས་ཀྱང་མེད།
en: They do not think about their parents, spouse, sons, or daughters.

source: སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ཡང་མི་དྲན་ཏེ།
en: They do not remember the Buddha, the Dharma, and the Saṅgha.

source: དེ་ཆང་གིས་མྱོས་པའི་མཐུས་དུར་ཁྲོད་ན་འདུག་ན་ཡང་འཇིགས་པ་མེད་ལ། འདི་སྙམ་དུ་སེམས་ཏེ།
en: Intoxicated like this, they become fearless. Even if they pass by a charnel ground, they think,

source: ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ང་སྐྲག་པར་བྱེད་ནུས་པ་སུ་ཞིག་ཡོད་སྙམ་མོ། །
en: ‘What god, nāga, or yakṣa can frighten me!’

source: དེ་བོང་བ་དང་། ཤིང་དང་། རྩྭ་དང་། ཚེར་མའི་མལ་གཞན་དག་ལ་བདེ་བའི་འདུ་ཤེས་སྐྱེད་པ་ལས།
en: They perceive mats made of dirt, wood, grass, or thorns as comfortable beds.

source: ལུས་སོར་ཆུད་ཅིང་ར་རོ་བ་དེ་སངས་ནས་གང་གི་ཚེ་དྲན་པ་རྙེད་པར་གྱུར་པ་དེའི་ཚེ་འགྱོད་པར་བྱེད་དེ།
en: Later, however, when they recover and awaken from their drunkenness and regain their senses, they feel remorse about their conduct

source: བདག་ནི་སྲོག་ལ་ཐུག་ཀྱང་བླ། བདག་གིས་ཆང་འདི་བཏུང་བར་མི་བྱའོ་སྙམ་མོ། །
en: and think, ‘Even at the cost of my life, I will never drink liquor again!’

source: དེ་བཞིན་དུ་སེམས་ཅན་འདོད་ཆགས་ཀྱིས་རྒྱགས་པས་མྱོས་ཤིང་།
en: “Similarly, beings whose minds are inebriated by desire and conceit,

source: ཁྱིམ་ན་གནས་པས་རྣམ་པར་འཁྲུལ་པ་ནོར་གྱིས་སེམས་མྱོས་པ་རྣམས་ཀྱིས་ནི་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ཡང་ཡོངས་སུ་ཚོལ་བར་མི་བྱེད།
en: deluded by their householder lives and intoxicated by wealth, do not seek out the Buddha, the Dharma, and the Saṅgha.

source: སྦྱིན་པ་ཡང་མི་དྲན།
en: They do not remember to be generous.

source: མཐོ་རིས་སུ་སྐྱེ་བ་དང་། རྒྱལ་པོར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བ་ཡང་ཡོངས་སུ་ཚོལ་བར་མི་བྱེད་དེ།
en: They do not strive to be reborn among the higher realms, as a king, or in the buddha realms.

source: འཁོར་བ་དེ་ཉིད་ན་འཁོར་ཞིང་སེམས་ཅན་དམྱལ་བ་དང་།
en: These beings will circle in saṃsāra,

source: དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་རྣམས་སུ་སྐྱེས་པའི་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་ལ།
en: experiencing the suffering of being reborn among the hell realms, the animal realms, or in the World of the Lord of Death.

source: བདག་གི་ལུས་ནི་བདེ་སྟེ། སྡུག་བསྔལ་བ་མེད་དོ་སྙམ་མོ། །
en: They think, ‘I’m healthy; I’m not suffering.’

source: གང་གི་ཚེ་སེམས་ཅན་དམྱལ་བ་དང་།
en: However, when these beings are liberated from the hell realms,

source: དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དེ་དག་ནས་ཐར་ཏེ།
en: the animal realms, and the World of the Lord of Death

source: བརྒྱ་ལ་བརྒྱ་ལམ་ན་མིའི་ལུས་ཐོབ་པར་གྱུར་པ་དེའི་ཚེ་མངལ་ན་གནས་པས་ལུས་ཡོངས་སུ་གཟིར
en: and take rebirth in a human body that is so difficult to obtain, their body becomes weary from the physical torments

source: ་ཅིང་མུན་ནག་གིས་
en: and the darkness endured while in the womb.

source: སྐྱོ་བར་གྱུར་པའི་ལུས་ལ་བད་ཀན་དང་། མཁྲིས་པ་དང་། ལྗན་ལྗིན་དང་། ཁྲག་དང་། ཕྱི་སས་བདས་པས་སྐྱོ་བར་གྱུར་ནས། །
en: Weary of soaking in blood and bile, phlegm, excrement, and filth,

source: འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་ལོ་བརྒྱའམ། བསྐལ་པའམ། བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ།
en: they think, ‘I have circled in saṃsāra for a hundred years, an eon, a hundred eons, a thousand eons,

source: བསྐལ་པ་འབུམ་གྱི་བར་དུ་འཁོར་བ་ན་འཁོར་ཞིང་སྡུག་བསྔལ་གྱི་ཚོར་བ་མི་བཟད་ཅིང་། ཡིད་དུ་མི་འོང་བ་མྱོང་ལ།
en: a hundred thousand eons. I have experienced all these unbearable, horrible, painful sensations.

source: གང་དུ་ཡང་བདག་ཅག་གིས་སྐྱབས་མེད་པ་འདི་ལས་གང་དག་གི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡིན་ཞིག་གུ།
en: I wonder what previous actions caused all these awful situations?

source: བདག་ཅག་གིས་ཀྱང་སྔོན་སྡིག་པ་མང་དུ་བྱས་སོ་སྙམ་སྟེ།
en: It must be due to my many evil deeds in the past!’

source: དེ་ལྟར་མངལ་ན་གནས་ནས་སེམས་ཅན་དམྱལ་བ་དང་འདྲ་བར་འགྱོད་པ་སྐྱེད་པར་བྱེད་དེ།
en: Even being in the womb produces similar regrets as those produced by the experience in the hells.

source: གང་གི་ཚེ་བདག་ཅག་མངལ་ན་གནས་པའི་སེམས་ཅན་དམྱལ་བ་འདི་ལས་ཐར་བར་གྱུར་པ་
en: So they promise themselves, ‘Once I am liberated from this hell-like womb,

source: དེའི་ཚེ་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་མི་ཕྱེད་པའི་དད་པས་བསྒྲུབ་པ་དང་བཙལ་བར་བྱ་སྟེ།
en: I will seek out the Buddha, the Dharma, and the Saṅgha with undivided faith.

source: ཅི་ནས་ཀྱང་བདག་ཅག་ཕྱིན་ཆད་མངལ་གྱི་སེམས་ཅན་དམྱལ་བར་གནས་པར་མི་འགྱུར་བར་བྱའོ་སྙམ་མོ།
en: I will by all means avoid this hell-like experience of the womb!’

source: དེ་དག་ཕྱིས་མངལ་གྱི་གནས་རྣམས་ལས་ཐར་ནས་བག་མེད་པར་བྱེད་དེ།
en: In spite of this, once they are liberated from the womb, they nevertheless continue to act carelessly

source: དེ་དག་ཡང་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་རོ། །
en: and experience the suffering of the hell realms all over again.

source: དེ་ལྟ་བས་ན་ནམས་ཀྱང་བག་མེད་པར་མི་བྱའོ། །
en: Therefore, never act carelessly!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that point venerable Ānanda asked,

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། འདི་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: “Blessed One, what is the name of this Dharma teaching? How should we remember it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་
en: “Ānanda,” replied the Blessed One,

source: དེའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱབས་བྱེད་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །
en: “remember this Dharma teaching as The Protector of All Beings

source: བྱང་ཆུབ་སེམས་དཔས་ཞུས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །བཀོད་པའི་རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: The Questions of the Bodhisattvas , The King of the Miraculous Display of the King of the Array

source: དེ་བཞིན་གཤེགས་པ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: The Complete Awakening of the Thus-Gone Ones

source: ཆོས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: and The King of the Array of All Dharma Qualities

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: When the Blessed One finished speaking,

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་དང་།
en: the bodhisattvas, the great śrāvakas, Śakra, Brahmā, the guardians of the world, and all their retinues,

source: ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: as well as the world with its gods, humans, asuras, and gandharvas, all rejoiced and praised the words of the Blessed One.

source: འཕགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the Noble Great Vehicle Sūtra “ The King of the Array of All Dharma Qualities

source: རྒྱ་གར་གྱི་མཁན་པོ་པྲཛྙཱ་བར་མ་དང་། སུ་རེན་དྲ་བོ་དྷི་དང་།
en: This was translated, edited and finalized by the Indian preceptors Prajñāvarman and Surendrabodhi,

source: ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ། །
en: the translator-editor Bandé Yeshé Dé, and others.
